{
    "general": {
        "menuBar": {
            "description": "Αλλάζει τις ρυθμίσεις ορατότητας της εγγενούς γραμμής μενού.",
            "labels": {
                "hide": "Αυτόματη απόκρυψη της γραμμής μενού (<kbd>το πλήκτρο ALT</kbd> αλλάζει την ορατότητα)."
            },
            "name": "Γραμμή μενού"
        },
        "tray": {
            "name": "Γραμμή συστήματος",
            "labels": {
                "disable": "Απενεργοποίηση της λειτουργίας απόκρυψης παραθύρου στην γραμμή συστήματος."
            },
            "description": "Αλλάζει την ορατότητα του εικονιδίου στην γραμμή συστήματος."
        },
        "taskbar": {
            "description": "Ελέγχει τη συμπεριφορά της καταχώρησης της γραμμής εργασιών του WebCord.",
            "labels": {
                "flash": "Αναβόσβησε το κουμπί της γραμμής εργασιών στα νέα μηνύματα."
            },
            "name": "Γραμμή εργασιών"
        },
        "name": "Γενικά"
    },
    "privacy": {
        "name": "Απόρρητο",
        "blockApi": {
            "name": "Αποκλεισμός Discord API",
            "description": "Αποκλείει τα αιτήματα Discord API για την ενίσχυση του απορρήτου.",
            "labels": {
                "science": "Αποκλείστε τα γνωστά τελικά σημεία τηλεμετρίας (<code>/science</code> και <code>/tracing</code>).",
                "typingIndicator": "Αποκλεισμούς Δείκτη πληκτρολόγησης (<code>/typing</code>).",
                "fingerprinting": "Αποκλεισμός Αποτύπωσης δακτυλικών αποτυπωμάτων <code>api.js</code> script."
            }
        },
        "permissions": {
            "name": "Άδειες",
            "description": "Επιτρέπει ή αρνείται τους ελέγχους αδειών και το αίτημα από τον ιστότοπο του Discord. Λάβετε υπόψη ότι άλλα δικαιώματα που δεν αναφέρονται εδώ μπλοκάρονται αυτόματα από το WebCord.",
            "labels": {
                "video": "Κάμερα",
                "audio": "Μικρόφωνο",
                "fullscreen": "Πλήρης οθόνη",
                "notifications": "Ειδοποιήσεις",
                "display-capture": "Καταγραφή επιφάνειας εργασίας",
                "background-sync": "Συγχρονισμός παρασκηνίου"
            }
        }
    },
    "advanced": {
        "csp": {
            "description": "Αλλάζει κάθε φορά που η εφαρμογή θα πρέπει να αγνοεί τις επικεφαλίδες της Πολιτικής Ασφάλειας Περιεχομένου του Discord και να αφήνει τον client να ορίσει τη δική του CSP για λόγους προστασίας του απορρήτου και ασφάλειας.",
            "labels": {
                "enabled": "Χρησιμοποιήστε την ενσωματωμένη Πολιτική ασφάλειας περιεχομένου."
            },
            "name": "Πολιτική ασφάλειας περιεχομένου"
        },
        "cspThirdParty": {
            "name": "Ιστοσελίδες τρίτων",
            "description": "Ορίζει μια λίστα με τους ιστότοπους τρίτων που επιτρέπεται να συνδεθούν ή να εμφανίσουν περιεχόμενο.",
            "labels": {
                "gif": "Πάροχοι GIF"
            }
        },
        "currentInstance": {
            "name": "Παράσταση Discord",
            "description": "Επιλέγει την περίπτωση στην οποία θα πρέπει να συνδεθεί το WebCord. <b>Πειραματικό</b> καθώς η υλοποίηση του Fosscord δεν έχει ολοκληρωθεί πλήρως."
        },
        "devel": {
            "description": "Επιτρέπει την πρόσβαση σε εργαλεία και ημιτελείς επιλογές που ενδεχομένως θεωρούνται χαλασμένες ή επικίνδυνες. <b>Αποποίηση ευθύνης</b>: οι συντηρητές της εφαρμογής δεν είναι υπεύθυνοι για τυχόν σφάλματα ή προβλήματα μετά την ενεργοποίηση αυτής της επιλογής - παρακαλούμε μην τα αναφέρετε!",
            "labels": {
                "enabled": "Ενεργοποίηση λειτουργίας προγραμματιστή."
            },
            "name": "Λειτουργία προγραμματιστή"
        },
        "redirection": {
            "labels": {
                "warn": "Να προειδοποιείτε πάντα τον χρήστη για ανακατευθύνσεις μεταξύ προελεύσεων σε εξωτερικές εφαρμογές."
            },
            "description": "Ελέγχει τις ενέργειες σε ανακατευθύνσεις πολλαπλής προέλευσης. <b>Αυτό επηρεάζει την ασφάλεια της εφαρμογής</b>.",
            "name": "Συμπεριφορά ανακατεύθυνσης πολλαπλής προέλευσης"
        },
        "optimize": {
            "name": "Βελτιστοποιήσεις client",
            "labels": {
                "gpu": "Βελτιστοποίηση του client-πελάτη για την τρέχουσα ενεργή κάρτα γραφικών."
            },
            "description": "Προσπαθεί να ανιχνεύσει το λογισμικό και το υλικό του χρήστη για να εφαρμόσει προσαρμοσμένες σημαίες στη μηχανή Chromium, οι οποίες <b>μπορεί να</b> βελτιώσουν την απόδοση ή τη λειτουργικότητα του Electron. <b>Πειραματικό</b>, καθώς υπάρχει λόγος που το Chromium δεν εφαρμόζει αυτές τις σημαίες από προεπιλογή."
        },
        "webApi": {
            "name": "Πρόσβαση σε API JavaScript",
            "description": "Ελέγχει ποια API θα πρέπει να επιτρέπονται σε μη προνομιούχα (DOM) σενάρια.",
            "labels": {
                "webGl": "Ενεργοποιήστε την υποστήριξη WebGL."
            }
        },
        "unix": {
            "name": "Πειραματικά χαρακτηριστικά για Unix/Unix-like OS",
            "description": "Ενεργοποιεί χαρακτηριστικά που έχουν επισημανθεί από τη μηχανή Chromium/Blink ως πειραματικά. <b>Χρησιμοποιήστε τα με δική σας ευθύνη</b>.",
            "labels": {
                "autoscroll": "Ενεργοποίηση κύλισης με μεσαίο κλικ (ή αλλιώς <i>autoscroll</i>)."
            }
        },
        "name": "Προχωρημένες"
    }
}
